code-review/NRB_3471_3546/База_Стало/Documents/ФормированиеРеестраВладельцев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФормированиеРеестраВладельцев</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийНеограниченнойДлины</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ФормированиеРеестраВладельцев/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(Основание)
		
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") Тогда
		
		Если 	Основание.ВидОперацииД   = Справочники.ВидыОпераций.ФормированиеРеестраВладельцевЦБ   Тогда
						
			//проверка на существование документов введенных на основании текущего основания.	
			Если ПроверкаНаСозданныеДокументыНаОснованииТекщего(Основание) Тогда
				
				Проверка = Истина;
				Сообщить("На основании данного поручения уже есть введенный документ!!!");
				Возврат;
				
			КонецЕсли;
			Дата						= ОбщегоНазначения.ДатаДокумента(Основание);
			ДокументОснование 			= Основание.Ссылка;			
			Если ТипЗнч(Основание.Инициатор) = Тип("СправочникСсылка.Контрагенты") Тогда
				Эмитент		 			= Основание.Инициатор;
			Иначе
				МестоХранения			= Основание.Инициатор;	
			КонецЕсли;	
			Автор 						= Основание.Автор;
			Изменил 					= Основание.Изменил;
			Комментарий					= Основание.Комментарий;
		Иначе
			Проверка = Истина;
			Сообщить("На основании данного вида поручения нельзя создать документ ""Формирование реестра владельцев"" !!!");
			Возврат;	
		КонецЕсли;
			
	КонецЕсли;
КонецПроцедуры

Функция ПроверкаНаСозданныеДокументыНаОснованииТекщего(Основание)
	
		ЗапретРедактирования   = Ложь;
	
		ЗапретРедактирования = НЕ Документы.ФормированиеРеестраВладельцев.НайтиПоРеквизиту("ДокументОснование",Основание).Пустая();
			
		Если ЗапретРедактирования Тогда
			
			Возврат Истина;
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;
		
КонецФункции // ПроверкаНаСозданныеДокументыНаОснованииТекщего()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры
